Tekla Open API Reference for Tekla Structures 2025
AlongPartCenteredPlacingType Constructor
 Creates a new along part centered placing type instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AlongPartCenteredPlacingType()
Public Sub New
See Also
Reference
AlongPartCenteredPlacingType Class
Tekla.Structures.Drawing Namespace